blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "mycusfield") VALUES (?, ?, ?, ?, ?, ?)  [["title", "frd"], ["body", "sdfdddsaadsasdDSDSAdsa"], ["created_at", "2022-06-05 23:02:16.679962"], ["updated_at", "2022-06-05 23:02:16.679962"], ["status", "public"], ["mycusfield", nil]]
---
  def create
    @article =  Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "fffff456"], ["body", "gghhhjgfdewqwewq hhhhhh"], ["updated_at", "2022-06-05 16:37:35.140928"], ["id", 3]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)